#=============================================================================
#아래와 같은 결과를 출력하는 function을 구현하라
#bool OneEditApart(string s1, string s2)
#OneEditApart("cat", "dog") = false
#OneEditApart("cat", "cats") = true
#OneEditApart("cat", "cut") = true
#OneEditApart("cat", "cast") = true
#OneEditApart("cat", "at") = true
#OneEditApart("cat", "acts") = false
#한개의 문자를 삽입, 제거, 변환을 했을때 s1, s2가 동일한지를 판별하는 OneEditApart 함수를 작성하시오.
#=============================================================================
#과제1. s1을 기준으로 한개의 문자를 삽입, 제거, 변환하였을 경우 s2가 나올 수 있는지 판별하시오.
#       - 조건 : 문자열에서 문자 1개를 삽입, 제거, 변환할 수 있는 횟수는 총 1회이다. (예 : 삽입과 제거 동시 사용 불가능)
#       - s1 = ‘cat’
#       - s2 =‘cats’
#       - 출력 = true

#과제 1 풀이

#=============================================================================
#과제2. s1을 기준으로 한개의 문자를 삽입, 제거, 변환하였을 경우 s2가 나올 수 있는지 판별하시오.
#       - 조건 : 문자열에서 문자 1개를 삽입, 제거, 변환할 수 있는 횟수는 총 1회이다. (예 : 삽입과 제거 동시 사용 불가능)
#       - s1 = ‘cat’
#       - s2 =‘acts’
#       - 출력 = false

#과제 2 풀이

#=============================================================================
