"""
-----------------  Question  -----------------
DashInsert 함수는 숫자로 구성된 문자열을 입력받은 뒤,
문자열 내에서 홀수가 연속되면 두 수 사이에 - 를 추가하고,
짝수가 연속되면 * 를 추가하는 기능을 갖고 있다.
(예, 454 => 454, 4546793 => 454*67-9-3)
DashInsert 함수를 완성하자.

입력 - 화면에서 숫자로 된 문자열을 입력받는다. : "4546793"
출력 - *, -가 적절히 추가된 문자열을 화면에 출력한다. : "454*67-9-3"
----------------------------------------------
"""
# 과제 1. 함수를 만들지 말고, 위 문제를 풀어보세요.
## input = "336917411"
## 출력 : 3-369-1-741-1


#과제 2. 함수를 만들어서 위 문제를 풀어보세요.(함수명은 "DashInsert"로 지정하세요)
## input = "13221478898889212122"
## 출력 :  1-32*21478*898*8*8921212*2
